flit/argon-rtos/src/devices/MKL28T7/MKL28T7_CORE1.h
#define __CM0PLUS_REV                  0x0000    /**< Core revision r0p0 */
#define __MPU_PRESENT                  0         /**< Defines if an MPU is present or not */
#define __VTOR_PRESENT                 1         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               2         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */

#include "core_cm0plus.h"              /* Core Peripheral Access Layer */
#include "system_MKL28T7_CORE1.h"      /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup edma_request
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum _dma_request_source
{
  #if defined(CPU_MKL28T512VDC7_CORE1) || defined(CPU_MKL28T512VLH7_CORE1) || defined(CPU_MKL28T512VLL7_CORE1) || defined(CPU_MKL28T512VMP7_CORE1)
      kDmaRequestMux0Disable          = 0|0x100U,    /**< DMAMUX TriggerDisabled. */
      kDmaRequestMux0FlexIO0Channel0  = 1|0x100U,    /**< FLEXIO0. */
      kDmaRequestMux0FlexIO0Channel1  = 2|0x100U,    /**< FLEXIO0. */
      kDmaRequestMux0FlexIO0Channel2  = 3|0x100U,    /**< FLEXIO0. */
      kDmaRequestMux0FlexIO0Channel3  = 4|0x100U,    /**< FLEXIO0. */
      kDmaRequestMux0FlexIO0Channel4  = 5|0x100U,    /**< FLEXIO0. */
      kDmaRequestMux0FlexIO0Channel5  = 6|0x100U,    /**< FLEXIO0. */
      kDmaRequestMux0FlexIO0Channel6  = 7|0x100U,    /**< FLEXIO0. */
      kDmaRequestMux0FlexIO0Channel7  = 8|0x100U,    /**< FLEXIO0. */
      kDmaRequestMux0LPI2C0Rx         = 9|0x100U,    /**< LPI2C0 Receive. */
      kDmaRequestMux0LPI2C0Tx         = 10|0x100U,   /**< LPI2C0 Transmit. */
      kDmaRequestMux0LPI2C1Rx         = 11|0x100U,   /**< LPI2C1 Receive. */
      kDmaRequestMux0LPI2C1Tx         = 12|0x100U,   /**< LPI2C1 Transmit. */
      kDmaRequestMux0LPI2C2Rx         = 13|0x100U,   /**< LPI2C2 Receive. */
      kDmaRequestMux0LPI2C2Tx         = 14|0x100U,   /**< LPI2C2 Transmit. */
      kDmaRequestMux0LPUART0Rx        = 15|0x100U,   /**< LPUART0 Receive. */
      kDmaRequestMux0LPUART0Tx        = 16|0x100U,   /**< LPUART0 Transmit. */
      kDmaRequestMux0LPUART1Rx        = 17|0x100U,   /**< LPUART1 Receive. */
      kDmaRequestMux0LPUART1Tx        = 18|0x100U,   /**< LPUART1 Transmit. */
      kDmaRequestMux0LPUART2Rx        = 19|0x100U,   /**< LPUART2 Receive. */
      kDmaRequestMux0LPUART2Tx        = 20|0x100U,   /**< LPUART2 Transmit. */
      kDmaRequestMux0LPSPI0Rx         = 21|0x100U,   /**< LPSPI0 Receive. */
      kDmaRequestMux0LPSPI0Tx         = 22|0x100U,   /**< LPSPI0 Transmit. */
      kDmaRequestMux0LPSPI1Rx         = 23|0x100U,   /**< LPSPI1 Receive. */
      kDmaRequestMux0LPSPI1Tx         = 24|0x100U,   /**< LPSPI1 Transmit. */
      kDmaRequestMux0LPSPI2Rx         = 25|0x100U,   /**< LPSPI2 Receive. */
      kDmaRequestMux0LPSPI2Tx         = 26|0x100U,   /**< LPSPI2 Transmit. */
      kDmaRequestMux0TPM0Channel0     = 27|0x100U,   /**< TPM0 C0V Transmit. */
      kDmaRequestMux0TPM0Channel1     = 28|0x100U,   /**< TPM0 C1V Transmit. */
      kDmaRequestMux0TPM0Channel2     = 29|0x100U,   /**< TPM0 C2V Transmit. */
      kDmaRequestMux0TPM0Channel3     = 30|0x100U,   /**< TPM0 C3V Transmit. */
      kDmaRequestMux0TPM0Channel4     = 31|0x100U,   /**< TPM0 C4V Transmit. */
      kDmaRequestMux0TPM0Channel5     = 32|0x100U,   /**< TPM0 C5V Transmit. */
      kDmaRequestMux0Reserved33       = 33|0x100U,   /**< Reserved33 */
      kDmaRequestMux0Reserved34       = 34|0x100U,   /**< Reserved34 */
      kDmaRequestMux0TPM0Overflow     = 35|0x100U,   /**< TPM0. */
      kDmaRequestMux0TPM1Channel0     = 36|0x100U,   /**< TPM1 C0V Transmit. */
      kDmaRequestMux0TPM1Channel1     = 37|0x100U,   /**< TPM1 C1V Transmit. */
      kDmaRequestMux0TPM1Overflow     = 38|0x100U,   /**< TPM1. */
      kDmaRequestMux0TPM2Channel0     = 39|0x100U,   /**< TPM2 C0V Transmit. */
      kDmaRequestMux0TPM2Channel1     = 40|0x100U,   /**< TPM2 C1V Transmit. */
      kDmaRequestMux0TPM2Overflow     = 41|0x100U,   /**< TPM2. */
      kDmaRequestMux0PortM            = 42|0x100U,   /**< PORTM. */
      kDmaRequestMux0EMVSIM0Rx        = 43|0x100U,   /**< EMVSIM0 Receive. */
      kDmaRequestMux0EMVSIM0Tx        = 44|0x100U,   /**< EMVSIM0 Transmit. */
      kDmaRequestMux0I2S0Rx           = 45|0x100U,   /**< I2S0 Receive. */
      kDmaRequestMux0I2S0Tx           = 46|0x100U,   /**< I2S0 Transmit. */
      kDmaRequestMux0PortA            = 47|0x100U,   /**< PTA. */
      kDmaRequestMux0PortB            = 48|0x100U,   /**< PTB. */
      kDmaRequestMux0PortC            = 49|0x100U,   /**< PTC. */
      kDmaRequestMux0PortD            = 50|0x100U,   /**< PTD. */
      kDmaRequestMux0PortE            = 51|0x100U,   /**< PTE. */
      kDmaRequestMux0ADC0             = 52|0x100U,   /**< ADC0. */
      kDmaRequestMux0Reserved53       = 53|0x100U,   /**< Reserved53 */
      kDmaRequestMux0DAC0             = 54|0x100U,   /**< DAC0. */
      kDmaRequestMux0Reserved55       = 55|0x100U,   /**< Reserved55 */
      kDmaRequestMux0CMP0             = 56|0x100U,   /**< CMP0. */
      kDmaRequestMux0CMP1             = 57|0x100U,   /**< CMP1. */
      kDmaRequestMux0Reserved58       = 58|0x100U,   /**< Reserved58 */
      kDmaRequestMux0Reserved59       = 59|0x100U,   /**< Reserved59 */
      kDmaRequestMux0TSI0             = 60|0x100U,   /**< TSI0. */
      kDmaRequestMux0LPTMR0           = 61|0x100U,   /**< LPTMR0. */
      kDmaRequestMux0LPTMR1           = 62|0x100U,   /**< LPTMR1. */
      kDmaRequestMux0AlwaysOn63       = 63|0x100U,   /**< DMAMUX Always Enabled slot. */
      kDmaRequestMux1Disable          = 0|0x200U,    /**< DMAMUX TriggerDisabled. */
      kDmaRequestMux1FlexIO0Channel0  = 1|0x200U,    /**< FLEXIO0. */
      kDmaRequestMux1FlexIO0Channel1  = 2|0x200U,    /**< FLEXIO0. */
      kDmaRequestMux1FlexIO0Channel2  = 3|0x200U,    /**< FLEXIO0. */
      kDmaRequestMux1FlexIO0Channel3  = 4|0x200U,    /**< FLEXIO0. */
      kDmaRequestMux1FlexIO0Channel4  = 5|0x200U,    /**< FLEXIO0. */
      kDmaRequestMux1FlexIO0Channel5  = 6|0x200U,    /**< FLEXIO0. */
      kDmaRequestMux1FlexIO0Channel6  = 7|0x200U,    /**< FLEXIO0. */
      kDmaRequestMux1FlexIO0Channel7  = 8|0x200U,    /**< FLEXIO0. */
      kDmaRequestMux1LPI2C0Rx         = 9|0x200U,    /**< LPI2C0 Receive. */
      kDmaRequestMux1LPI2C0Tx         = 10|0x200U,   /**< LPI2C0 Transmit. */
      kDmaRequestMux1LPI2C1Rx         = 11|0x200U,   /**< LPI2C1 Receive. */
      kDmaRequestMux1LPI2C1Tx         = 12|0x200U,   /**< LPI2C1 Transmit. */
      kDmaRequestMux1LPI2C2Rx         = 13|0x200U,   /**< LPI2C2 Receive. */
      kDmaRequestMux1LPI2C2Tx         = 14|0x200U,   /**< LPI2C2 Transmit. */
      kDmaRequestMux1LPUART0Rx        = 15|0x200U,   /**< LPUART0 Receive. */
      kDmaRequestMux1LPUART0Tx        = 16|0x200U,   /**< LPUART0 Transmit. */
      kDmaRequestMux1LPUART1Rx        = 17|0x200U,   /**< LPUART1 Receive. */
      kDmaRequestMux1LPUART1Tx        = 18|0x200U,   /**< LPUART1 Transmit. */
      kDmaRequestMux1LPUART2Rx        = 19|0x200U,   /**< LPUART2 Receive. */
      kDmaRequestMux1LPUART2Tx        = 20|0x200U,   /**< LPUART2 Transmit. */
      kDmaRequestMux1LPSPI0Rx         = 21|0x200U,   /**< LPSPI0 Receive. */
      kDmaRequestMux1LPSPI0Tx         = 22|0x200U,   /**< LPSPI0 Transmit. */
      kDmaRequestMux1LPSPI1Rx         = 23|0x200U,   /**< LPSPI1 Receive. */
      kDmaRequestMux1LPSPI1Tx         = 24|0x200U,   /**< LPSPI1 Transmit. */
      kDmaRequestMux1LPSPI2Rx         = 25|0x200U,   /**< LPSPI2 Receive. */
      kDmaRequestMux1LPSPI2Tx         = 26|0x200U,   /**< LPSPI2 Transmit. */
      kDmaRequestMux1TPM0Channel0     = 27|0x200U,   /**< TPM0 C0V Transmit. */
      kDmaRequestMux1TPM0Channel1     = 28|0x200U,   /**< TPM0 C1V Transmit. */
      kDmaRequestMux1TPM0Channel2     = 29|0x200U,   /**< TPM0 C2V Transmit. */
      kDmaRequestMux1TPM0Channel3     = 30|0x200U,   /**< TPM0 C3V Transmit. */
      kDmaRequestMux1TPM0Channel4     = 31|0x200U,   /**< TPM0 C4V Transmit. */
      kDmaRequestMux1TPM0Channel5     = 32|0x200U,   /**< TPM0 C5V Transmit. */
      kDmaRequestMux1Reserved33       = 33|0x200U,   /**< Reserved33 */
      kDmaRequestMux1Reserved34       = 34|0x200U,   /**< Reserved34 */
      kDmaRequestMux1TPM0Overflow     = 35|0x200U,   /**< TPM0. */
      kDmaRequestMux1TPM1Channel0     = 36|0x200U,   /**< TPM1 C0V Transmit. */
      kDmaRequestMux1TPM1Channel1     = 37|0x200U,   /**< TPM1 C1V Transmit. */
      kDmaRequestMux1TPM1Overflow     = 38|0x200U,   /**< TPM1. */
      kDmaRequestMux1TPM2Channel0     = 39|0x200U,   /**< TPM2 C0V Transmit. */
      kDmaRequestMux1TPM2Channel1     = 40|0x200U,   /**< TPM2 C1V Transmit. */
      kDmaRequestMux1TPM2Overflow     = 41|0x200U,   /**< TPM2. */
      kDmaRequestMux1PortM            = 42|0x200U,   /**< PORTM. */
      kDmaRequestMux1EMVSIM0Rx        = 43|0x200U,   /**< EMVSIM0 Receive. */
      kDmaRequestMux1EMVSIM0Tx        = 44|0x200U,   /**< EMVSIM0 Transmit. */
      kDmaRequestMux1I2S0Rx           = 45|0x200U,   /**< I2S0 Receive. */
      kDmaRequestMux1I2S0Tx           = 46|0x200U,   /**< I2S0 Transmit. */
      kDmaRequestMux1PortA            = 47|0x200U,   /**< PTA. */
      kDmaRequestMux1PortB            = 48|0x200U,   /**< PTB. */
      kDmaRequestMux1PortC            = 49|0x200U,   /**< PTC. */
      kDmaRequestMux1PortD            = 50|0x200U,   /**< PTD. */
      kDmaRequestMux1PortE            = 51|0x200U,   /**< PTE. */
      kDmaRequestMux1ADC0             = 52|0x200U,   /**< ADC0. */
      kDmaRequestMux1Reserved53       = 53|0x200U,   /**< Reserved53 */
      kDmaRequestMux1DAC0             = 54|0x200U,   /**< DAC0. */
      kDmaRequestMux1Reserved55       = 55|0x200U,   /**< Reserved55 */
      kDmaRequestMux1CMP0             = 56|0x200U,   /**< CMP0. */
      kDmaRequestMux1CMP1             = 57|0x200U,   /**< CMP1. */
      kDmaRequestMux1Reserved58       = 58|0x200U,   /**< Reserved58 */
      kDmaRequestMux1Reserved59       = 59|0x200U,   /**< Reserved59 */
      kDmaRequestMux1TSI0             = 60|0x200U,   /**< TSI0. */
      kDmaRequestMux1LPTMR0           = 61|0x200U,   /**< LPTMR0. */
      kDmaRequestMux1LPTMR1           = 62|0x200U,   /**< LPTMR1. */
      kDmaRequestMux1AlwaysOn63       = 63|0x200U,   /**< DMAMUX Always Enabled slot. */
  #else
      #error "No valid CPU defined!"
  #endif
} dma_request_source_t;

/* @} */

/*!
 * @addtogroup trgmux_source
 * @{ */

