flit/argon-rtos/src/devices/MKL28T7/MKL28T7_CORE1.h
/*! @name CNT - Watchdog Counter Register */
#define WDOG_CNT_CNTLOW_MASK                     (0xFFU)
#define WDOG_CNT_CNTLOW_SHIFT                    (0U)
#define WDOG_CNT_CNTLOW(x)                       (((uint32_t)(((uint32_t)(x)) << WDOG_CNT_CNTLOW_SHIFT)) & WDOG_CNT_CNTLOW_MASK)
#define WDOG_CNT_CNTHIGH_MASK                    (0xFF00U)
#define WDOG_CNT_CNTHIGH_SHIFT                   (8U)
#define WDOG_CNT_CNTHIGH(x)                      (((uint32_t)(((uint32_t)(x)) << WDOG_CNT_CNTHIGH_SHIFT)) & WDOG_CNT_CNTHIGH_MASK)

/*! @name TOVAL - Watchdog Timeout Value Register */
#define WDOG_TOVAL_TOVALLOW_MASK                 (0xFFU)
#define WDOG_TOVAL_TOVALLOW_SHIFT                (0U)
#define WDOG_TOVAL_TOVALLOW(x)                   (((uint32_t)(((uint32_t)(x)) << WDOG_TOVAL_TOVALLOW_SHIFT)) & WDOG_TOVAL_TOVALLOW_MASK)
#define WDOG_TOVAL_TOVALHIGH_MASK                (0xFF00U)
#define WDOG_TOVAL_TOVALHIGH_SHIFT               (8U)
#define WDOG_TOVAL_TOVALHIGH(x)                  (((uint32_t)(((uint32_t)(x)) << WDOG_TOVAL_TOVALHIGH_SHIFT)) & WDOG_TOVAL_TOVALHIGH_MASK)

/*! @name WIN - Watchdog Window Register */
#define WDOG_WIN_WINLOW_MASK                     (0xFFU)
#define WDOG_WIN_WINLOW_SHIFT                    (0U)
#define WDOG_WIN_WINLOW(x)                       (((uint32_t)(((uint32_t)(x)) << WDOG_WIN_WINLOW_SHIFT)) & WDOG_WIN_WINLOW_MASK)
#define WDOG_WIN_WINHIGH_MASK                    (0xFF00U)
#define WDOG_WIN_WINHIGH_SHIFT                   (8U)
#define WDOG_WIN_WINHIGH(x)                      (((uint32_t)(((uint32_t)(x)) << WDOG_WIN_WINHIGH_SHIFT)) & WDOG_WIN_WINHIGH_MASK)


/*!
 * @}
 */ /* end of group WDOG_Register_Masks */


/* WDOG - Peripheral instance base addresses */
/** Peripheral WDOG0 base address */
#define WDOG0_BASE                               (0x40076000u)
/** Peripheral WDOG0 base pointer */
#define WDOG0                                    ((WDOG_Type *)WDOG0_BASE)
/** Peripheral WDOG1 base address */
#define WDOG1_BASE                               (0x400F6000u)
/** Peripheral WDOG1 base pointer */
#define WDOG1                                    ((WDOG_Type *)WDOG1_BASE)
/** Array initializer of WDOG peripheral base addresses */
#define WDOG_BASE_ADDRS                          { WDOG0_BASE, WDOG1_BASE }
/** Array initializer of WDOG peripheral base pointers */
#define WDOG_BASE_PTRS                           { WDOG0, WDOG1 }
#define WDOG_UPDATE_KEY                          (0xD928C520U)
#define WDOG_REFRESH_KEY                         (0xB480A602U)


/*!
 * @}
 */ /* end of group WDOG_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- XRDC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XRDC_Peripheral_Access_Layer XRDC Peripheral Access Layer
 * @{
 */

/** XRDC - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR;                                /**< Control Register, offset: 0x0 */
       uint8_t RESERVED_0[236];
  __I  uint32_t HWCFG0;                            /**< Hardware Configuration Register 0, offset: 0xF0 */
  __I  uint32_t HWCFG1;                            /**< Hardware Configuration Register 1, offset: 0xF4 */
  __I  uint32_t HWCFG2;                            /**< Hardware Configuration Register 2, offset: 0xF8 */
  __I  uint32_t HWCFG3;                            /**< Hardware Configuration Register 3, offset: 0xFC */
  __I  uint8_t MDACFG[38];                         /**< Master Domain Assignment Configuration Register, array offset: 0x100, array step: 0x1 */
       uint8_t RESERVED_1[26];
  __I  uint8_t MRCFG[2];                           /**< Memory Region Configuration Register, array offset: 0x140, array step: 0x1 */
       uint8_t RESERVED_2[190];
  __I  uint32_t DERRLOC[3];                        /**< Domain Error Location Register, array offset: 0x200, array step: 0x4 */
       uint8_t RESERVED_3[500];
  __IO uint32_t DERR_W[19][4];                     /**< Domain Error Word0 Register..Domain Error Word3 Register, array offset: 0x400, array step: index*0x10, index2*0x4 */
       uint8_t RESERVED_4[464];
  __IO uint32_t PID[37];                           /**< Process Identifier, array offset: 0x700, array step: 0x4 */
       uint8_t RESERVED_5[108];
  struct {                                         /* offset: 0x800, array step: 0x20 */
    __IO uint32_t MDA_Wm_n[2];                       /**< Master Domain Assignment Wm,n (DFMT=0), array offset: 0x800, array step: index*0x20, index2*0x4 */
         uint8_t RESERVED_0[24];
  } MDA_W_n[38];
       uint8_t RESERVED_6[832];
  __IO uint32_t PDAC_W[257][2];                    /**< Peripheral Domain Access Control W0..Peripheral Domain Access Control W1, array offset: 0x1000, array step: index*0x8, index2*0x4 */
       uint8_t RESERVED_7[2040];
  __IO uint32_t MRGD_W[24][8];                     /**< Memory Region Descriptor W0..Memory Region Descriptor W7, array offset: 0x2000, array step: index*0x20, index2*0x4 */
} XRDC_Type;

/* ----------------------------------------------------------------------------
   -- XRDC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XRDC_Register_Masks XRDC Register Masks
 * @{
 */

/*! @name CR - Control Register */
#define XRDC_CR_GVLD_MASK                        (0x1U)
#define XRDC_CR_GVLD_SHIFT                       (0U)
#define XRDC_CR_GVLD(x)                          (((uint32_t)(((uint32_t)(x)) << XRDC_CR_GVLD_SHIFT)) & XRDC_CR_GVLD_MASK)
#define XRDC_CR_HRL_MASK                         (0x1EU)
#define XRDC_CR_HRL_SHIFT                        (1U)
#define XRDC_CR_HRL(x)                           (((uint32_t)(((uint32_t)(x)) << XRDC_CR_HRL_SHIFT)) & XRDC_CR_HRL_MASK)
#define XRDC_CR_MRF_MASK                         (0x80U)
#define XRDC_CR_MRF_SHIFT                        (7U)
#define XRDC_CR_MRF(x)                           (((uint32_t)(((uint32_t)(x)) << XRDC_CR_MRF_SHIFT)) & XRDC_CR_MRF_MASK)
#define XRDC_CR_VAW_MASK                         (0x100U)
#define XRDC_CR_VAW_SHIFT                        (8U)
#define XRDC_CR_VAW(x)                           (((uint32_t)(((uint32_t)(x)) << XRDC_CR_VAW_SHIFT)) & XRDC_CR_VAW_MASK)
#define XRDC_CR_LK1_MASK                         (0x40000000U)
#define XRDC_CR_LK1_SHIFT                        (30U)
#define XRDC_CR_LK1(x)                           (((uint32_t)(((uint32_t)(x)) << XRDC_CR_LK1_SHIFT)) & XRDC_CR_LK1_MASK)

/*! @name HWCFG0 - Hardware Configuration Register 0 */
#define XRDC_HWCFG0_NDID_MASK                    (0xFFU)
#define XRDC_HWCFG0_NDID_SHIFT                   (0U)
#define XRDC_HWCFG0_NDID(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG0_NDID_SHIFT)) & XRDC_HWCFG0_NDID_MASK)
#define XRDC_HWCFG0_NMSTR_MASK                   (0xFF00U)
#define XRDC_HWCFG0_NMSTR_SHIFT                  (8U)
#define XRDC_HWCFG0_NMSTR(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG0_NMSTR_SHIFT)) & XRDC_HWCFG0_NMSTR_MASK)
#define XRDC_HWCFG0_NMRC_MASK                    (0xFF0000U)
#define XRDC_HWCFG0_NMRC_SHIFT                   (16U)
#define XRDC_HWCFG0_NMRC(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG0_NMRC_SHIFT)) & XRDC_HWCFG0_NMRC_MASK)
#define XRDC_HWCFG0_NPAC_MASK                    (0xF000000U)
#define XRDC_HWCFG0_NPAC_SHIFT                   (24U)
#define XRDC_HWCFG0_NPAC(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG0_NPAC_SHIFT)) & XRDC_HWCFG0_NPAC_MASK)

/*! @name HWCFG1 - Hardware Configuration Register 1 */
#define XRDC_HWCFG1_DID_MASK                     (0xFU)
#define XRDC_HWCFG1_DID_SHIFT                    (0U)
#define XRDC_HWCFG1_DID(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG1_DID_SHIFT)) & XRDC_HWCFG1_DID_MASK)

/*! @name HWCFG2 - Hardware Configuration Register 2 */
#define XRDC_HWCFG2_PIDP0_MASK                   (0x1U)
#define XRDC_HWCFG2_PIDP0_SHIFT                  (0U)
#define XRDC_HWCFG2_PIDP0(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP0_SHIFT)) & XRDC_HWCFG2_PIDP0_MASK)
#define XRDC_HWCFG2_PIDP1_MASK                   (0x2U)
#define XRDC_HWCFG2_PIDP1_SHIFT                  (1U)
#define XRDC_HWCFG2_PIDP1(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP1_SHIFT)) & XRDC_HWCFG2_PIDP1_MASK)
#define XRDC_HWCFG2_PIDP2_MASK                   (0x4U)
#define XRDC_HWCFG2_PIDP2_SHIFT                  (2U)
#define XRDC_HWCFG2_PIDP2(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP2_SHIFT)) & XRDC_HWCFG2_PIDP2_MASK)
#define XRDC_HWCFG2_PIDP3_MASK                   (0x8U)
#define XRDC_HWCFG2_PIDP3_SHIFT                  (3U)
#define XRDC_HWCFG2_PIDP3(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP3_SHIFT)) & XRDC_HWCFG2_PIDP3_MASK)
#define XRDC_HWCFG2_PIDP4_MASK                   (0x10U)
#define XRDC_HWCFG2_PIDP4_SHIFT                  (4U)
#define XRDC_HWCFG2_PIDP4(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP4_SHIFT)) & XRDC_HWCFG2_PIDP4_MASK)
#define XRDC_HWCFG2_PIDP5_MASK                   (0x20U)
#define XRDC_HWCFG2_PIDP5_SHIFT                  (5U)
#define XRDC_HWCFG2_PIDP5(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP5_SHIFT)) & XRDC_HWCFG2_PIDP5_MASK)
#define XRDC_HWCFG2_PIDP6_MASK                   (0x40U)
#define XRDC_HWCFG2_PIDP6_SHIFT                  (6U)
#define XRDC_HWCFG2_PIDP6(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP6_SHIFT)) & XRDC_HWCFG2_PIDP6_MASK)
#define XRDC_HWCFG2_PIDP7_MASK                   (0x80U)
#define XRDC_HWCFG2_PIDP7_SHIFT                  (7U)
#define XRDC_HWCFG2_PIDP7(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP7_SHIFT)) & XRDC_HWCFG2_PIDP7_MASK)
#define XRDC_HWCFG2_PIDP8_MASK                   (0x100U)
#define XRDC_HWCFG2_PIDP8_SHIFT                  (8U)
#define XRDC_HWCFG2_PIDP8(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP8_SHIFT)) & XRDC_HWCFG2_PIDP8_MASK)
#define XRDC_HWCFG2_PIDP9_MASK                   (0x200U)
#define XRDC_HWCFG2_PIDP9_SHIFT                  (9U)
#define XRDC_HWCFG2_PIDP9(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP9_SHIFT)) & XRDC_HWCFG2_PIDP9_MASK)
#define XRDC_HWCFG2_PIDP10_MASK                  (0x400U)
#define XRDC_HWCFG2_PIDP10_SHIFT                 (10U)
#define XRDC_HWCFG2_PIDP10(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP10_SHIFT)) & XRDC_HWCFG2_PIDP10_MASK)
#define XRDC_HWCFG2_PIDP11_MASK                  (0x800U)
#define XRDC_HWCFG2_PIDP11_SHIFT                 (11U)
#define XRDC_HWCFG2_PIDP11(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP11_SHIFT)) & XRDC_HWCFG2_PIDP11_MASK)
#define XRDC_HWCFG2_PIDP12_MASK                  (0x1000U)
#define XRDC_HWCFG2_PIDP12_SHIFT                 (12U)
#define XRDC_HWCFG2_PIDP12(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP12_SHIFT)) & XRDC_HWCFG2_PIDP12_MASK)
#define XRDC_HWCFG2_PIDP13_MASK                  (0x2000U)
#define XRDC_HWCFG2_PIDP13_SHIFT                 (13U)
#define XRDC_HWCFG2_PIDP13(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP13_SHIFT)) & XRDC_HWCFG2_PIDP13_MASK)
#define XRDC_HWCFG2_PIDP14_MASK                  (0x4000U)
#define XRDC_HWCFG2_PIDP14_SHIFT                 (14U)
#define XRDC_HWCFG2_PIDP14(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP14_SHIFT)) & XRDC_HWCFG2_PIDP14_MASK)
#define XRDC_HWCFG2_PIDP15_MASK                  (0x8000U)
#define XRDC_HWCFG2_PIDP15_SHIFT                 (15U)
#define XRDC_HWCFG2_PIDP15(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP15_SHIFT)) & XRDC_HWCFG2_PIDP15_MASK)
#define XRDC_HWCFG2_PIDP16_MASK                  (0x10000U)
#define XRDC_HWCFG2_PIDP16_SHIFT                 (16U)
#define XRDC_HWCFG2_PIDP16(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP16_SHIFT)) & XRDC_HWCFG2_PIDP16_MASK)
#define XRDC_HWCFG2_PIDP17_MASK                  (0x20000U)
#define XRDC_HWCFG2_PIDP17_SHIFT                 (17U)
#define XRDC_HWCFG2_PIDP17(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP17_SHIFT)) & XRDC_HWCFG2_PIDP17_MASK)
#define XRDC_HWCFG2_PIDP18_MASK                  (0x40000U)
#define XRDC_HWCFG2_PIDP18_SHIFT                 (18U)
#define XRDC_HWCFG2_PIDP18(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP18_SHIFT)) & XRDC_HWCFG2_PIDP18_MASK)
#define XRDC_HWCFG2_PIDP19_MASK                  (0x80000U)
#define XRDC_HWCFG2_PIDP19_SHIFT                 (19U)
#define XRDC_HWCFG2_PIDP19(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP19_SHIFT)) & XRDC_HWCFG2_PIDP19_MASK)
#define XRDC_HWCFG2_PIDP20_MASK                  (0x100000U)
#define XRDC_HWCFG2_PIDP20_SHIFT                 (20U)
#define XRDC_HWCFG2_PIDP20(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP20_SHIFT)) & XRDC_HWCFG2_PIDP20_MASK)
#define XRDC_HWCFG2_PIDP21_MASK                  (0x200000U)
#define XRDC_HWCFG2_PIDP21_SHIFT                 (21U)
#define XRDC_HWCFG2_PIDP21(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP21_SHIFT)) & XRDC_HWCFG2_PIDP21_MASK)
#define XRDC_HWCFG2_PIDP22_MASK                  (0x400000U)
#define XRDC_HWCFG2_PIDP22_SHIFT                 (22U)
#define XRDC_HWCFG2_PIDP22(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP22_SHIFT)) & XRDC_HWCFG2_PIDP22_MASK)
#define XRDC_HWCFG2_PIDP23_MASK                  (0x800000U)
#define XRDC_HWCFG2_PIDP23_SHIFT                 (23U)
#define XRDC_HWCFG2_PIDP23(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP23_SHIFT)) & XRDC_HWCFG2_PIDP23_MASK)
#define XRDC_HWCFG2_PIDP24_MASK                  (0x1000000U)
#define XRDC_HWCFG2_PIDP24_SHIFT                 (24U)
#define XRDC_HWCFG2_PIDP24(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP24_SHIFT)) & XRDC_HWCFG2_PIDP24_MASK)
#define XRDC_HWCFG2_PIDP25_MASK                  (0x2000000U)
#define XRDC_HWCFG2_PIDP25_SHIFT                 (25U)
#define XRDC_HWCFG2_PIDP25(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP25_SHIFT)) & XRDC_HWCFG2_PIDP25_MASK)
#define XRDC_HWCFG2_PIDP26_MASK                  (0x4000000U)
#define XRDC_HWCFG2_PIDP26_SHIFT                 (26U)
#define XRDC_HWCFG2_PIDP26(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP26_SHIFT)) & XRDC_HWCFG2_PIDP26_MASK)
#define XRDC_HWCFG2_PIDP27_MASK                  (0x8000000U)
#define XRDC_HWCFG2_PIDP27_SHIFT                 (27U)
#define XRDC_HWCFG2_PIDP27(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP27_SHIFT)) & XRDC_HWCFG2_PIDP27_MASK)
#define XRDC_HWCFG2_PIDP28_MASK                  (0x10000000U)
#define XRDC_HWCFG2_PIDP28_SHIFT                 (28U)
#define XRDC_HWCFG2_PIDP28(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP28_SHIFT)) & XRDC_HWCFG2_PIDP28_MASK)
#define XRDC_HWCFG2_PIDP29_MASK                  (0x20000000U)
#define XRDC_HWCFG2_PIDP29_SHIFT                 (29U)
#define XRDC_HWCFG2_PIDP29(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP29_SHIFT)) & XRDC_HWCFG2_PIDP29_MASK)
#define XRDC_HWCFG2_PIDP30_MASK                  (0x40000000U)
#define XRDC_HWCFG2_PIDP30_SHIFT                 (30U)
#define XRDC_HWCFG2_PIDP30(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP30_SHIFT)) & XRDC_HWCFG2_PIDP30_MASK)
#define XRDC_HWCFG2_PIDP31_MASK                  (0x80000000U)
#define XRDC_HWCFG2_PIDP31_SHIFT                 (31U)
#define XRDC_HWCFG2_PIDP31(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP31_SHIFT)) & XRDC_HWCFG2_PIDP31_MASK)

/*! @name HWCFG3 - Hardware Configuration Register 3 */
#define XRDC_HWCFG3_PIDP32_MASK                  (0x1U)
#define XRDC_HWCFG3_PIDP32_SHIFT                 (0U)
#define XRDC_HWCFG3_PIDP32(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP32_SHIFT)) & XRDC_HWCFG3_PIDP32_MASK)
#define XRDC_HWCFG3_PIDP33_MASK                  (0x2U)
#define XRDC_HWCFG3_PIDP33_SHIFT                 (1U)
#define XRDC_HWCFG3_PIDP33(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP33_SHIFT)) & XRDC_HWCFG3_PIDP33_MASK)
#define XRDC_HWCFG3_PIDP34_MASK                  (0x4U)
#define XRDC_HWCFG3_PIDP34_SHIFT                 (2U)
#define XRDC_HWCFG3_PIDP34(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP34_SHIFT)) & XRDC_HWCFG3_PIDP34_MASK)
#define XRDC_HWCFG3_PIDP35_MASK                  (0x8U)
#define XRDC_HWCFG3_PIDP35_SHIFT                 (3U)
#define XRDC_HWCFG3_PIDP35(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP35_SHIFT)) & XRDC_HWCFG3_PIDP35_MASK)
#define XRDC_HWCFG3_PIDP36_MASK                  (0x10U)
#define XRDC_HWCFG3_PIDP36_SHIFT                 (4U)
#define XRDC_HWCFG3_PIDP36(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP36_SHIFT)) & XRDC_HWCFG3_PIDP36_MASK)
#define XRDC_HWCFG3_PIDP37_MASK                  (0x20U)
#define XRDC_HWCFG3_PIDP37_SHIFT                 (5U)
#define XRDC_HWCFG3_PIDP37(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP37_SHIFT)) & XRDC_HWCFG3_PIDP37_MASK)
#define XRDC_HWCFG3_PIDP38_MASK                  (0x40U)
#define XRDC_HWCFG3_PIDP38_SHIFT                 (6U)
#define XRDC_HWCFG3_PIDP38(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP38_SHIFT)) & XRDC_HWCFG3_PIDP38_MASK)
#define XRDC_HWCFG3_PIDP39_MASK                  (0x80U)
#define XRDC_HWCFG3_PIDP39_SHIFT                 (7U)
#define XRDC_HWCFG3_PIDP39(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP39_SHIFT)) & XRDC_HWCFG3_PIDP39_MASK)
#define XRDC_HWCFG3_PIDP40_MASK                  (0x100U)
#define XRDC_HWCFG3_PIDP40_SHIFT                 (8U)
#define XRDC_HWCFG3_PIDP40(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP40_SHIFT)) & XRDC_HWCFG3_PIDP40_MASK)
#define XRDC_HWCFG3_PIDP41_MASK                  (0x200U)
#define XRDC_HWCFG3_PIDP41_SHIFT                 (9U)
#define XRDC_HWCFG3_PIDP41(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP41_SHIFT)) & XRDC_HWCFG3_PIDP41_MASK)
#define XRDC_HWCFG3_PIDP42_MASK                  (0x400U)
#define XRDC_HWCFG3_PIDP42_SHIFT                 (10U)
#define XRDC_HWCFG3_PIDP42(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP42_SHIFT)) & XRDC_HWCFG3_PIDP42_MASK)
#define XRDC_HWCFG3_PIDP43_MASK                  (0x800U)
#define XRDC_HWCFG3_PIDP43_SHIFT                 (11U)
#define XRDC_HWCFG3_PIDP43(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP43_SHIFT)) & XRDC_HWCFG3_PIDP43_MASK)
#define XRDC_HWCFG3_PIDP44_MASK                  (0x1000U)
#define XRDC_HWCFG3_PIDP44_SHIFT                 (12U)
#define XRDC_HWCFG3_PIDP44(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP44_SHIFT)) & XRDC_HWCFG3_PIDP44_MASK)
#define XRDC_HWCFG3_PIDP45_MASK                  (0x2000U)
#define XRDC_HWCFG3_PIDP45_SHIFT                 (13U)
#define XRDC_HWCFG3_PIDP45(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP45_SHIFT)) & XRDC_HWCFG3_PIDP45_MASK)
#define XRDC_HWCFG3_PIDP46_MASK                  (0x4000U)
#define XRDC_HWCFG3_PIDP46_SHIFT                 (14U)
#define XRDC_HWCFG3_PIDP46(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP46_SHIFT)) & XRDC_HWCFG3_PIDP46_MASK)
#define XRDC_HWCFG3_PIDP47_MASK                  (0x8000U)
#define XRDC_HWCFG3_PIDP47_SHIFT                 (15U)
#define XRDC_HWCFG3_PIDP47(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP47_SHIFT)) & XRDC_HWCFG3_PIDP47_MASK)
#define XRDC_HWCFG3_PIDP48_MASK                  (0x10000U)
#define XRDC_HWCFG3_PIDP48_SHIFT                 (16U)
#define XRDC_HWCFG3_PIDP48(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP48_SHIFT)) & XRDC_HWCFG3_PIDP48_MASK)
#define XRDC_HWCFG3_PIDP49_MASK                  (0x20000U)
#define XRDC_HWCFG3_PIDP49_SHIFT                 (17U)
#define XRDC_HWCFG3_PIDP49(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP49_SHIFT)) & XRDC_HWCFG3_PIDP49_MASK)
#define XRDC_HWCFG3_PIDP50_MASK                  (0x40000U)
#define XRDC_HWCFG3_PIDP50_SHIFT                 (18U)
#define XRDC_HWCFG3_PIDP50(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP50_SHIFT)) & XRDC_HWCFG3_PIDP50_MASK)
#define XRDC_HWCFG3_PIDP51_MASK                  (0x80000U)
#define XRDC_HWCFG3_PIDP51_SHIFT                 (19U)
#define XRDC_HWCFG3_PIDP51(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP51_SHIFT)) & XRDC_HWCFG3_PIDP51_MASK)
#define XRDC_HWCFG3_PIDP52_MASK                  (0x100000U)
#define XRDC_HWCFG3_PIDP52_SHIFT                 (20U)
#define XRDC_HWCFG3_PIDP52(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP52_SHIFT)) & XRDC_HWCFG3_PIDP52_MASK)
#define XRDC_HWCFG3_PIDP53_MASK                  (0x200000U)
#define XRDC_HWCFG3_PIDP53_SHIFT                 (21U)
#define XRDC_HWCFG3_PIDP53(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP53_SHIFT)) & XRDC_HWCFG3_PIDP53_MASK)
#define XRDC_HWCFG3_PIDP54_MASK                  (0x400000U)
#define XRDC_HWCFG3_PIDP54_SHIFT                 (22U)
#define XRDC_HWCFG3_PIDP54(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP54_SHIFT)) & XRDC_HWCFG3_PIDP54_MASK)
#define XRDC_HWCFG3_PIDP55_MASK                  (0x800000U)
#define XRDC_HWCFG3_PIDP55_SHIFT                 (23U)
#define XRDC_HWCFG3_PIDP55(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP55_SHIFT)) & XRDC_HWCFG3_PIDP55_MASK)
#define XRDC_HWCFG3_PIDP56_MASK                  (0x1000000U)
#define XRDC_HWCFG3_PIDP56_SHIFT                 (24U)
#define XRDC_HWCFG3_PIDP56(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP56_SHIFT)) & XRDC_HWCFG3_PIDP56_MASK)
#define XRDC_HWCFG3_PIDP57_MASK                  (0x2000000U)
#define XRDC_HWCFG3_PIDP57_SHIFT                 (25U)
#define XRDC_HWCFG3_PIDP57(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP57_SHIFT)) & XRDC_HWCFG3_PIDP57_MASK)
#define XRDC_HWCFG3_PIDP58_MASK                  (0x4000000U)
#define XRDC_HWCFG3_PIDP58_SHIFT                 (26U)
#define XRDC_HWCFG3_PIDP58(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP58_SHIFT)) & XRDC_HWCFG3_PIDP58_MASK)
#define XRDC_HWCFG3_PIDP59_MASK                  (0x8000000U)
#define XRDC_HWCFG3_PIDP59_SHIFT                 (27U)
#define XRDC_HWCFG3_PIDP59(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP59_SHIFT)) & XRDC_HWCFG3_PIDP59_MASK)
#define XRDC_HWCFG3_PIDP60_MASK                  (0x10000000U)
#define XRDC_HWCFG3_PIDP60_SHIFT                 (28U)
#define XRDC_HWCFG3_PIDP60(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP60_SHIFT)) & XRDC_HWCFG3_PIDP60_MASK)
#define XRDC_HWCFG3_PIDP61_MASK                  (0x20000000U)
#define XRDC_HWCFG3_PIDP61_SHIFT                 (29U)
#define XRDC_HWCFG3_PIDP61(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP61_SHIFT)) & XRDC_HWCFG3_PIDP61_MASK)
#define XRDC_HWCFG3_PIDP62_MASK                  (0x40000000U)
#define XRDC_HWCFG3_PIDP62_SHIFT                 (30U)
#define XRDC_HWCFG3_PIDP62(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP62_SHIFT)) & XRDC_HWCFG3_PIDP62_MASK)
#define XRDC_HWCFG3_PIDP63_MASK                  (0x80000000U)
#define XRDC_HWCFG3_PIDP63_SHIFT                 (31U)
#define XRDC_HWCFG3_PIDP63(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG3_PIDP63_SHIFT)) & XRDC_HWCFG3_PIDP63_MASK)

