flit/argon-rtos/src/devices/MKL28T7/MKL28T7_CORE1.h
/*! @name MDACFG - Master Domain Assignment Configuration Register */
#define XRDC_MDACFG_NMDAR_MASK                   (0xFU)
#define XRDC_MDACFG_NMDAR_SHIFT                  (0U)
#define XRDC_MDACFG_NMDAR(x)                     (((uint8_t)(((uint8_t)(x)) << XRDC_MDACFG_NMDAR_SHIFT)) & XRDC_MDACFG_NMDAR_MASK)
#define XRDC_MDACFG_NCM_MASK                     (0x80U)
#define XRDC_MDACFG_NCM_SHIFT                    (7U)
#define XRDC_MDACFG_NCM(x)                       (((uint8_t)(((uint8_t)(x)) << XRDC_MDACFG_NCM_SHIFT)) & XRDC_MDACFG_NCM_MASK)

/* The count of XRDC_MDACFG */
#define XRDC_MDACFG_COUNT                        (38U)

/*! @name MRCFG - Memory Region Configuration Register */
#define XRDC_MRCFG_NMGD_MASK                     (0x1FU)
#define XRDC_MRCFG_NMGD_SHIFT                    (0U)
#define XRDC_MRCFG_NMGD(x)                       (((uint8_t)(((uint8_t)(x)) << XRDC_MRCFG_NMGD_SHIFT)) & XRDC_MRCFG_NMGD_MASK)

/* The count of XRDC_MRCFG */
#define XRDC_MRCFG_COUNT                         (2U)

/*! @name DERRLOC - Domain Error Location Register */
#define XRDC_DERRLOC_MRCINST_MASK                (0xFFFFU)
#define XRDC_DERRLOC_MRCINST_SHIFT               (0U)
#define XRDC_DERRLOC_MRCINST(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_DERRLOC_MRCINST_SHIFT)) & XRDC_DERRLOC_MRCINST_MASK)
#define XRDC_DERRLOC_PACINST_MASK                (0xF0000U)
#define XRDC_DERRLOC_PACINST_SHIFT               (16U)
#define XRDC_DERRLOC_PACINST(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_DERRLOC_PACINST_SHIFT)) & XRDC_DERRLOC_PACINST_MASK)

/* The count of XRDC_DERRLOC */
#define XRDC_DERRLOC_COUNT                       (3U)

/*! @name DERR_W - Domain Error Word0 Register..Domain Error Word3 Register */
#define XRDC_DERR_W_EDID_MASK                    (0xFU)
#define XRDC_DERR_W_EDID_SHIFT                   (0U)
#define XRDC_DERR_W_EDID(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W_EDID_SHIFT)) & XRDC_DERR_W_EDID_MASK)
#define XRDC_DERR_W_EADDR_MASK                   (0xFFFFFFFFU)
#define XRDC_DERR_W_EADDR_SHIFT                  (0U)
#define XRDC_DERR_W_EADDR(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W_EADDR_SHIFT)) & XRDC_DERR_W_EADDR_MASK)
#define XRDC_DERR_W_EATR_MASK                    (0x700U)
#define XRDC_DERR_W_EATR_SHIFT                   (8U)
#define XRDC_DERR_W_EATR(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W_EATR_SHIFT)) & XRDC_DERR_W_EATR_MASK)
#define XRDC_DERR_W_ERW_MASK                     (0x800U)
#define XRDC_DERR_W_ERW_SHIFT                    (11U)
#define XRDC_DERR_W_ERW(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W_ERW_SHIFT)) & XRDC_DERR_W_ERW_MASK)
#define XRDC_DERR_W_EPORT_MASK                   (0x7000000U)
#define XRDC_DERR_W_EPORT_SHIFT                  (24U)
#define XRDC_DERR_W_EPORT(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W_EPORT_SHIFT)) & XRDC_DERR_W_EPORT_MASK)
#define XRDC_DERR_W_EST_MASK                     (0xC0000000U)
#define XRDC_DERR_W_EST_SHIFT                    (30U)
#define XRDC_DERR_W_EST(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W_EST_SHIFT)) & XRDC_DERR_W_EST_MASK)
#define XRDC_DERR_W_RECR_MASK                    (0xC0000000U)
#define XRDC_DERR_W_RECR_SHIFT                   (30U)
#define XRDC_DERR_W_RECR(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W_RECR_SHIFT)) & XRDC_DERR_W_RECR_MASK)

/* The count of XRDC_DERR_W */
#define XRDC_DERR_W_COUNT                        (19U)

/* The count of XRDC_DERR_W */
#define XRDC_DERR_W_COUNT2                       (4U)

/*! @name PID - Process Identifier */
#define XRDC_PID_PID_MASK                        (0x3FU)
#define XRDC_PID_PID_SHIFT                       (0U)
#define XRDC_PID_PID(x)                          (((uint32_t)(((uint32_t)(x)) << XRDC_PID_PID_SHIFT)) & XRDC_PID_PID_MASK)
#define XRDC_PID_TSM_MASK                        (0x10000000U)
#define XRDC_PID_TSM_SHIFT                       (28U)
#define XRDC_PID_TSM(x)                          (((uint32_t)(((uint32_t)(x)) << XRDC_PID_TSM_SHIFT)) & XRDC_PID_TSM_MASK)
#define XRDC_PID_LK2_MASK                        (0x60000000U)
#define XRDC_PID_LK2_SHIFT                       (29U)
#define XRDC_PID_LK2(x)                          (((uint32_t)(((uint32_t)(x)) << XRDC_PID_LK2_SHIFT)) & XRDC_PID_LK2_MASK)

/* The count of XRDC_PID */
#define XRDC_PID_COUNT                           (37U)

/*! @name MDA_Wm_n - Master Domain Assignment Wm,n (DFMT=0) */
#define XRDC_MDA_Wm_n_DID_MASK                   (0xFU)
#define XRDC_MDA_Wm_n_DID_SHIFT                  (0U)
#define XRDC_MDA_Wm_n_DID(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_Wm_n_DID_SHIFT)) & XRDC_MDA_Wm_n_DID_MASK)
#define XRDC_MDA_Wm_n_DIDS_MASK                  (0x30U)
#define XRDC_MDA_Wm_n_DIDS_SHIFT                 (4U)
#define XRDC_MDA_Wm_n_DIDS(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_Wm_n_DIDS_SHIFT)) & XRDC_MDA_Wm_n_DIDS_MASK)
#define XRDC_MDA_Wm_n_PE_MASK                    (0xC0U)
#define XRDC_MDA_Wm_n_PE_SHIFT                   (6U)
#define XRDC_MDA_Wm_n_PE(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_Wm_n_PE_SHIFT)) & XRDC_MDA_Wm_n_PE_MASK)
#define XRDC_MDA_Wm_n_PIDM_MASK                  (0x3F00U)
#define XRDC_MDA_Wm_n_PIDM_SHIFT                 (8U)
#define XRDC_MDA_Wm_n_PIDM(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_Wm_n_PIDM_SHIFT)) & XRDC_MDA_Wm_n_PIDM_MASK)
#define XRDC_MDA_Wm_n_PID_MASK                   (0x3F0000U)
#define XRDC_MDA_Wm_n_PID_SHIFT                  (16U)
#define XRDC_MDA_Wm_n_PID(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_Wm_n_PID_SHIFT)) & XRDC_MDA_Wm_n_PID_MASK)
#define XRDC_MDA_Wm_n_LPID_MASK                  (0xF000000U)
#define XRDC_MDA_Wm_n_LPID_SHIFT                 (24U)
#define XRDC_MDA_Wm_n_LPID(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_Wm_n_LPID_SHIFT)) & XRDC_MDA_Wm_n_LPID_MASK)
#define XRDC_MDA_Wm_n_LPE_MASK                   (0x10000000U)
#define XRDC_MDA_Wm_n_LPE_SHIFT                  (28U)
#define XRDC_MDA_Wm_n_LPE(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_Wm_n_LPE_SHIFT)) & XRDC_MDA_Wm_n_LPE_MASK)
#define XRDC_MDA_Wm_n_DFMT_MASK                  (0x20000000U)
#define XRDC_MDA_Wm_n_DFMT_SHIFT                 (29U)
#define XRDC_MDA_Wm_n_DFMT(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_Wm_n_DFMT_SHIFT)) & XRDC_MDA_Wm_n_DFMT_MASK)
#define XRDC_MDA_Wm_n_LK1_MASK                   (0x40000000U)
#define XRDC_MDA_Wm_n_LK1_SHIFT                  (30U)
#define XRDC_MDA_Wm_n_LK1(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_Wm_n_LK1_SHIFT)) & XRDC_MDA_Wm_n_LK1_MASK)
#define XRDC_MDA_Wm_n_VLD_MASK                   (0x80000000U)
#define XRDC_MDA_Wm_n_VLD_SHIFT                  (31U)
#define XRDC_MDA_Wm_n_VLD(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_Wm_n_VLD_SHIFT)) & XRDC_MDA_Wm_n_VLD_MASK)

/* The count of XRDC_MDA_Wm_n */
#define XRDC_MDA_Wm_n_COUNT                      (38U)

/* The count of XRDC_MDA_Wm_n */
#define XRDC_MDA_Wm_n_COUNT2                     (2U)

/*! @name PDAC_W - Peripheral Domain Access Control W0..Peripheral Domain Access Control W1 */
#define XRDC_PDAC_W_D0ACP_MASK                   (0x7U)
#define XRDC_PDAC_W_D0ACP_SHIFT                  (0U)
#define XRDC_PDAC_W_D0ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D0ACP_SHIFT)) & XRDC_PDAC_W_D0ACP_MASK)
#define XRDC_PDAC_W_D8ACP_MASK                   (0x7U)
#define XRDC_PDAC_W_D8ACP_SHIFT                  (0U)
#define XRDC_PDAC_W_D8ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D8ACP_SHIFT)) & XRDC_PDAC_W_D8ACP_MASK)
#define XRDC_PDAC_W_D1ACP_MASK                   (0x38U)
#define XRDC_PDAC_W_D1ACP_SHIFT                  (3U)
#define XRDC_PDAC_W_D1ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D1ACP_SHIFT)) & XRDC_PDAC_W_D1ACP_MASK)
#define XRDC_PDAC_W_D9ACP_MASK                   (0x38U)
#define XRDC_PDAC_W_D9ACP_SHIFT                  (3U)
#define XRDC_PDAC_W_D9ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D9ACP_SHIFT)) & XRDC_PDAC_W_D9ACP_MASK)
#define XRDC_PDAC_W_D10ACP_MASK                  (0x1C0U)
#define XRDC_PDAC_W_D10ACP_SHIFT                 (6U)
#define XRDC_PDAC_W_D10ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D10ACP_SHIFT)) & XRDC_PDAC_W_D10ACP_MASK)
#define XRDC_PDAC_W_D2ACP_MASK                   (0x1C0U)
#define XRDC_PDAC_W_D2ACP_SHIFT                  (6U)
#define XRDC_PDAC_W_D2ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D2ACP_SHIFT)) & XRDC_PDAC_W_D2ACP_MASK)
#define XRDC_PDAC_W_D11ACP_MASK                  (0xE00U)
#define XRDC_PDAC_W_D11ACP_SHIFT                 (9U)
#define XRDC_PDAC_W_D11ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D11ACP_SHIFT)) & XRDC_PDAC_W_D11ACP_MASK)
#define XRDC_PDAC_W_D3ACP_MASK                   (0xE00U)
#define XRDC_PDAC_W_D3ACP_SHIFT                  (9U)
#define XRDC_PDAC_W_D3ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D3ACP_SHIFT)) & XRDC_PDAC_W_D3ACP_MASK)
#define XRDC_PDAC_W_D4ACP_MASK                   (0x7000U)
#define XRDC_PDAC_W_D4ACP_SHIFT                  (12U)
#define XRDC_PDAC_W_D4ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D4ACP_SHIFT)) & XRDC_PDAC_W_D4ACP_MASK)
#define XRDC_PDAC_W_D12ACP_MASK                  (0x7000U)
#define XRDC_PDAC_W_D12ACP_SHIFT                 (12U)
#define XRDC_PDAC_W_D12ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D12ACP_SHIFT)) & XRDC_PDAC_W_D12ACP_MASK)
#define XRDC_PDAC_W_D5ACP_MASK                   (0x38000U)
#define XRDC_PDAC_W_D5ACP_SHIFT                  (15U)
#define XRDC_PDAC_W_D5ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D5ACP_SHIFT)) & XRDC_PDAC_W_D5ACP_MASK)
#define XRDC_PDAC_W_D13ACP_MASK                  (0x38000U)
#define XRDC_PDAC_W_D13ACP_SHIFT                 (15U)
#define XRDC_PDAC_W_D13ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D13ACP_SHIFT)) & XRDC_PDAC_W_D13ACP_MASK)
#define XRDC_PDAC_W_D14ACP_MASK                  (0x1C0000U)
#define XRDC_PDAC_W_D14ACP_SHIFT                 (18U)
#define XRDC_PDAC_W_D14ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D14ACP_SHIFT)) & XRDC_PDAC_W_D14ACP_MASK)
#define XRDC_PDAC_W_D6ACP_MASK                   (0x1C0000U)
#define XRDC_PDAC_W_D6ACP_SHIFT                  (18U)
#define XRDC_PDAC_W_D6ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D6ACP_SHIFT)) & XRDC_PDAC_W_D6ACP_MASK)
#define XRDC_PDAC_W_D15ACP_MASK                  (0xE00000U)
#define XRDC_PDAC_W_D15ACP_SHIFT                 (21U)
#define XRDC_PDAC_W_D15ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D15ACP_SHIFT)) & XRDC_PDAC_W_D15ACP_MASK)
#define XRDC_PDAC_W_D7ACP_MASK                   (0xE00000U)
#define XRDC_PDAC_W_D7ACP_SHIFT                  (21U)
#define XRDC_PDAC_W_D7ACP(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_D7ACP_SHIFT)) & XRDC_PDAC_W_D7ACP_MASK)
#define XRDC_PDAC_W_SNUM_MASK                    (0x3F000000U)
#define XRDC_PDAC_W_SNUM_SHIFT                   (24U)
#define XRDC_PDAC_W_SNUM(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_SNUM_SHIFT)) & XRDC_PDAC_W_SNUM_MASK)
#define XRDC_PDAC_W_LK2_MASK                     (0x60000000U)
#define XRDC_PDAC_W_LK2_SHIFT                    (29U)
#define XRDC_PDAC_W_LK2(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_LK2_SHIFT)) & XRDC_PDAC_W_LK2_MASK)
#define XRDC_PDAC_W_SE_MASK                      (0x40000000U)
#define XRDC_PDAC_W_SE_SHIFT                     (30U)
#define XRDC_PDAC_W_SE(x)                        (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_SE_SHIFT)) & XRDC_PDAC_W_SE_MASK)
#define XRDC_PDAC_W_VLD_MASK                     (0x80000000U)
#define XRDC_PDAC_W_VLD_SHIFT                    (31U)
#define XRDC_PDAC_W_VLD(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W_VLD_SHIFT)) & XRDC_PDAC_W_VLD_MASK)

/* The count of XRDC_PDAC_W */
#define XRDC_PDAC_W_COUNT                        (257U)

/* The count of XRDC_PDAC_W */
#define XRDC_PDAC_W_COUNT2                       (2U)

